Evrenotur/STM32_Register/STM32_Register_f103/001_REGISTER_CLOCK_CONFIGURATION/src/main.c


/* Includes */
#include <stddef.h>
#include "stm32f10x.h"

extern uint32_t SystemCoreClock;

uint32_t  systemclock;


void RCC_Config(void)
{

RCC->CR &= ~(1<<0);             // HSI Disable
///RCC->CR &= 0x00000083;       // CR register reset
RCC->CR |= 1<<16;               // HSE Enable
while(!(RCC->CR & 1<<17));      // HSERDY Enable
RCC->CR |= 1<<19;               //  Clock security system enable
}



int main(void)
{
systemclock = SystemCoreClock;

RCC_DeInit();              // HSI Osilatörü Enable ve PLL OFF Olmaktadır.

SystemCoreClockUpdate();   // 24 MHZ Sabit Kılmaktadır

systemclock = SystemCoreClock;

RCC_Config();

  /* Infinite loop */
  while (1)
  {









  }
}

#ifdef  USE_FULL_ASSERT

/**
  * @brief  Reports the name of the source file and the source line number
  *   where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  while (1)
  {
  }
}
#endif

/*
 * Minimal __assert_func used by the assert() macro
 * */
void __assert_func(const char *file, int line, const char *func, const char *failedexpr)
{
  while(1)
  {}
}

/*
 * Minimal __assert() uses __assert__func()
 * */
void __assert(const char *file, int line, const char *failedexpr)
{
   __assert_func (file, line, NULL, failedexpr);
}

#ifdef USE_SEE
#ifndef USE_DEFAULT_TIMEOUT_CALLBACK
/**
  * @brief  Basic management of the timeout situation.
  * @param  None.
  * @retval sEE_FAIL.
  */
uint32_t sEE_TIMEOUT_UserCallback(void)
{
  /* Return with error code */
  return sEE_FAIL;
}
#endif
#endif /* USE_SEE */

